//SYMJOB   JOB (ACCT),'SYMBOLIC',CLASS=A,MSGCLASS=X
//         JCLLIB ORDER=(PROD.PROCLIB,SHARED.PROCLIB)
//         SET HLQ=PROD,PGMNAME=PAYROLL
//*
//RUNSTEP  EXEC PGM=&PGMNAME
//EMPIN    DD DSN=&HLQ..PAYROLL.MASTER,DISP=SHR
//PAYOUT   DD DSN=&HLQ..PAYROLL.RESULTS,DISP=(NEW,CATLG,DELETE)
//MYSTERY  DD DSN=&UNDEF..FILE,DISP=SHR
//*
//ARCH     EXEC PROC=ARCHP,DSNAME=ARCHIVE
//*
//ARCHP    PROC DSNAME=DEFLT
//COPYSTEP EXEC PGM=IEBGENER
//SYSUT2   DD DSN=&HLQ..&DSNAME,DISP=(NEW,CATLG)
//         PEND
